# Questions
1. Count Male and Female Passengers
2. Count Survivied Passengers
3. Count Casualties
4. Name of the eldest person
5. Count of passengers as per class
6. Count of passengers whose name starts with 's'
7. Create new column to add 'SibSp' & 'Parch' columns
8. Count of passengers with age below 25
9. Cound of died passengers below age 40
10. Separate text and number from "Cabin" column

In [1]:
print("!! Jai Ganesh !!")

!! Jai Ganesh !!

In [2]:
import pandas as pd

In [3]:
df1=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
df1.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [5]:
df1.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
df1.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# Answers

### 1. Count Male and Female Passengers

In [7]:
male=df1[df1['Sex']=='male'].count()['Sex']
female=df1[df1['Sex']=='female'].count()['Sex']
print("male_count:",male, '&', "female_count:",female)

male_count: 577 & female_count: 314

### 2. Count Survived Passengers

In [8]:
survived=df1[df1['Survived']==1]['Survived'].count()
print("Total Survived: ",survived)

Total Survived:  342

### 3. Count of Casualties

In [9]:
casualty=df1[df1['Survived']==0]['Survived'].count()
print("Total Casualty: ",casualty)

Total Casualty:  549

### 4. Name of the eldest person

In [10]:
eldest=list(df1[df1['Age']==max(df1['Age'])]['Name'])
print("Eldest person in titanic was: ",eldest[0])

Eldest person in titanic was:  Thomas, Master. Assad Alexander

### 5. Count of passengers as per class

In [11]:
first=df1[df1['Pclass']==1].count()['Pclass']
second=df1[df1['Pclass']==2].count()['Pclass']
third=df1[df1['Pclass']==3].count()['Pclass']

print("Passangers in 'First Class' was: ",first,"\nin 'Second Class' was: ",second,"\n& in 'Third Class' was: ",third)

Passangers in 'First Class' was:  216
in 'Second Class' was:  184
& in 'Third Class' was:  491

### 6. Count of passengers whose name starts with 'S'

In [12]:
a=0
for i in df1['Name']:
    if i[0][0]=='S':
        #print(i)
        a=a+1
print("There are Total ",a,"People with name starting with 's'.")

There are Total  86 People with name starting with 's'.

### 7. Create new column to add 'SibSp' & 'Parch' columns

In [13]:
df1["Sum"]=df1["SibSp"]+df1["Parch"]
df1.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sum
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1

### 8. Count of passengers with age below 25

In [14]:
ageb25=df1[df1['Age']<25].count()['Age']
print("Number of passangers with Age below 25 were, ",ageb25)

Number of passangers with Age below 25 were,  278

### 9. Cound of died passengers below age 40

In [15]:
a=df1[df1['Survived']==0]['Age']
b=0
for i in a:
    if i<40:
        b=b+1
print(b,"People died whose age was less than 40")

322 People died whose age was less than 40

### 10. Separate text and number from "Cabin" column

In [16]:
import re

In [17]:
#Removing 'null' values
a=df1[df1['Cabin'].isnull()==False]

In [18]:
for i in a["Cabin"]:
    if len(i)==1:
        print(i)

D
D
T
D

In [19]:
#There are some values which looks like "A27 B25 A15", Removing blank space from them
b=[]
for i in a["Cabin"]:
    #print(i.split(" "))
    #if len(i)>4:
    b.append(i.split(" "))
    #if len(i)==1:
        #b.append(i)
#len(b)
#b

In [20]:
#There are some invalid values with single character, removing them 
c=[]
for i in b:
    if len(i)>1:
        c.append(i)

In [21]:
#there are some nested lists, removing single charaters from them also
for i in b:
    if len(i)>1:
        b.remove(i)

In [22]:
#Extracting values from nested list
d=[]
for i in c:
    for j in i:
        d.append(j)

In [23]:

for i in b:
    for j in i:
        d.append(j)

In [24]:
len(d)

246

In [25]:
for i in d:
    if len(i)<=1:
        d.remove(i)

In [26]:
e=[]
for i in range(len(d)):
    b=re.findall(r'(\w+?)(\d+)', d[i])[0] 
    e.append(b)

In [27]:
e

[('C', '23'),
 ('C', '25'),
 ('C', '27'),
 ('G', '73'),
 ('C', '23'),
 ('C', '25'),
 ('C', '27'),
 ('D', '10'),
 ('D', '12'),
 ('B', '58'),
 ('B', '60'),
 ('E', '69'),
 ('C', '22'),
 ('C', '26'),
 ('B', '58'),
 ('B', '60'),
 ('C', '22'),
 ('C', '26'),
 ('B', '57'),
 ('B', '59'),
 ('B', '63'),
 ('B', '66'),
 ('C', '23'),
 ('C', '25'),
 ('C', '27'),
 ('B', '96'),
 ('B', '98'),
 ('B', '96'),
 ('B', '98'),
 ('C', '23'),
 ('C', '25'),
 ('C', '27'),
 ('C', '22'),
 ('C', '26'),
 ('B', '51'),
 ('B', '53'),
 ('B', '55'),
 ('G', '63'),
 ('C', '62'),
 ('C', '64'),
 ('G', '73'),
 ('B', '57'),
 ('B', '59'),
 ('B', '63'),
 ('B', '66'),
 ('B', '96'),
 ('B', '98'),
 ('B', '82'),
 ('B', '84'),
 ('B', '96'),
 ('B', '98'),
 ('B', '51'),
 ('B', '53'),
 ('B', '55'),
 ('C', '85'),
 ('C', '123'),
 ('E', '46'),
 ('G', '6'),
 ('C', '103'),
 ('D', '56'),
 ('A', '6'),
 ('B', '78'),
 ('D', '33'),
 ('B', '30'),
 ('C', '52'),
 ('B', '28'),
 ('C', '83'),
 ('F', '33'),
 ('E', '31'),
 ('A', '5'),
 ('D', '26'),
 ('C', '110'),
 ('E', '101'),
 ('D', '26'),
 ('D', '47'),
 ('C', '123'),
 ('B', '86'),
 ('F', '2'),
 ('C', '2'),
 ('E', '33'),
 ('B', '19'),
 ('A', '7'),
 ('C', '49'),
 ('F', '4'),
 ('A', '32'),
 ('F', '2'),
 ('B', '4'),
 ('B', '80'),
 ('G', '6'),
 ('A', '31'),
 ('D', '36'),
 ('D', '15'),
 ('C', '93'),
 ('C', '83'),
 ('C', '78'),
 ('D', '35'),
 ('G', '6'),
 ('C', '87'),
 ('B', '77'),
 ('E', '67'),
 ('B', '94'),
 ('C', '125'),
 ('C', '99'),
 ('C', '118'),
 ('D', '7'),
 ('A', '19'),
 ('B', '49'),
 ('C', '106'),
 ('E', '101'),
 ('C', '65'),
 ('E', '36'),
 ('C', '54'),
 ('C', '7'),
 ('E', '34'),
 ('C', '32'),
 ('B', '18'),
 ('C', '124'),
 ('C', '91'),
 ('C', '2'),
 ('E', '40'),
 ('F', '2'),
 ('C', '23'),
 ('C', '25'),
 ('C', '27'),
 ('F', '33'),
 ('C', '128'),
 ('E', '33'),
 ('D', '37'),
 ('B', '35'),
 ('E', '50'),
 ('C', '82'),
 ('D', '36'),
 ('G', '6'),
 ('C', '78'),
 ('E', '10'),
 ('C', '52'),
 ('E', '44'),
 ('C', '23'),
 ('C', '25'),
 ('C', '27'),
 ('A', '34'),
 ('C', '104'),
 ('C', '111'),
 ('C', '92'),
 ('E', '38'),
 ('D', '21'),
 ('E', '12'),
 ('E', '63'),
 ('A', '14'),
 ('B', '49'),
 ('C', '93'),
 ('B', '37'),
 ('C', '30'),
 ('D', '20'),
 ('B', '79'),
 ('C', '65'),
 ('E', '25'),
 ('D', '46'),
 ('F', '33'),
 ('B', '73'),
 ('B', '18'),
 ('C', '95'),
 ('B', '38'),
 ('B', '39'),
 ('B', '22'),
 ('C', '86'),
 ('C', '70'),
 ('A', '16'),
 ('E', '67'),
 ('C', '101'),
 ('E', '25'),
 ('E', '44'),
 ('C', '68'),
 ('A', '10'),
 ('E', '68'),
 ('B', '41'),
 ('D', '20'),
 ('A', '20'),
 ('C', '125'),
 ('F', '4'),
 ('D', '19'),
 ('D', '50'),
 ('D', '9'),
 ('A', '23'),
 ('B', '50'),
 ('B', '35'),
 ('D', '33'),
 ('A', '26'),
 ('D', '48'),
 ('E', '58'),
 ('C', '126'),
 ('B', '71'),
 ('D', '49'),
 ('B', '5'),
 ('B', '20'),
 ('C', '68'),
 ('C', '62'),
 ('C', '64'),
 ('E', '24'),
 ('E', '24'),
 ('C', '90'),
 ('C', '124'),
 ('C', '126'),
 ('C', '45'),
 ('E', '101'),
 ('E', '8'),
 ('B', '5'),
 ('B', '101'),
 ('D', '45'),
 ('C', '46'),
 ('B', '22'),
 ('D', '30'),
 ('E', '121'),
 ('B', '77'),
 ('D', '11'),
 ('E', '77'),
 ('F', '38'),
 ('B', '3'),
 ('B', '20'),
 ('D', '6'),
 ('D', '17'),
 ('A', '36'),
 ('E', '8'),
 ('B', '102'),
 ('B', '69'),
 ('E', '121'),
 ('B', '28'),
 ('E', '49'),
 ('C', '47'),
 ('C', '92'),
 ('D', '28'),
 ('E', '17'),
 ('D', '17'),
 ('A', '24'),
 ('D', '35'),
 ('C', '50'),
 ('B', '42'),
 ('C', '148')]